#!/usr/bin/bash
# author: David wang

blue(){
    echo -e "\033[34m\033[01m$1\033[0m"  # 蓝色字体
}

blue "======================================================================="
blue "欢迎使用此脚本，脚本开始运行"
blue "开始更新系统组件，若没有则自动跳过!"
blue "======================================================================="

sudo yum -y update

sudo yum -y upgrade

echo ""

blue "======================================================================="
blue "开始检测是否安装了curl，若无则安装如有则更新!"
blue "======================================================================="

echo ""

curl --version

echo ""

sudo yum -y install curl

echo ""

sudo yum -y update curl

echo ""

blue "======================================================================="
blue "开始检测是否安装了wget，若无则安装如有则更新!"
blue "======================================================================="

echo ""

wget --version

echo ""

blue "======================================================================="
blue "开始检测是否安装了Python最新版本"
blue "======================================================================="

echo ""

python3 --version

echo ""

echo ""

sudo yum -y update python3

echo ""

blue "======================================================================="
blue "开始检测是否安装了pip3"
blue "======================================================================="

echo ""

pip3

echo ""

blue "======================================================================="
blue "开始安装pip3"
blue "======================================================================="

echo ""

sudo yum -y install python3-pip

echo ""

blue "======================================================================="
blue "开始更新pip3"
blue "======================================================================="

echo ""

sudo python3 -m pip freeze > requirements.txt

echo ""

sudo python3 -m pip install -r requirements.txt --upgrade

echo ""

blue "======================================================================="
blue "开始清除垃圾文件……"
blue "======================================================================="

echo ""

sudo yum -y autoremove

echo ""

sudo rm -y requirements.txt

echo ""

blue "======================================================================="
blue "一键更新全部更新安装完毕，感谢您使用此脚本，欢迎再次使用此脚本。"
blue "如需再次使用此脚本，只需输入bash centos.sh命令即可再次使用。"
blue "======================================================================="
